The-Nicolini/M365-JBD-BATTERY-BRIDGE-ESP32/src/main.cpp

/**
 * JBD BMS <-> Xiaomi M365 ESC Bridge  +  WiFi AP battery web dashboard
 * Target: ESP32 (any variant)
 *
 * WiFi:
 *   ESP32 creates an AP with SSID "M365-BMS" (password below).
 *   Connect and open http://192.168.4.1 to view the live battery dashboard.
 *   /data returns a JSON snapshot polled by the page every second.
 *
 * Wiring:
 *   ESP32 GPIO16 (RX1) <-- JBD BMS TX
 *   ESP32 GPIO17 (TX1) --> JBD BMS RX
 *   ESP32 GPIO18 (RX2) <-- M365 ESC BMS-UART TX
 *   ESP32 GPIO19 (TX2) --> M365 ESC BMS-UART RX
 *   Common GND required between ESP32, JBD BMS, and M365 ESC.
 *
 * IMPORTANT — voltage levels:
 *   JBD BMS UART is typically 3.3 V. Direct connection to ESP32 is fine.
 *   M365 ESC BMS UART is 3.3 V. Direct connection to ESP32 is fine.
 *   DO NOT connect 5 V UART directly to ESP32 GPIO without a level shifter.
 *
 * Protocol notes:
 *   JBD: 9600 8N1. Poll with DD A5 xx 00 [crc_hi crc_lo] 77.
 *        Response: DD xx 00 <len> <data*len> <crc_hi crc_lo> 77
 *        CRC = 0x10000 - sum(all bytes between len and last data byte inclusive)
 *
 *   M365: 115200 8N1. Packet: 55 AA <pkt_len> <src> <dst> <cmd> [data] <crc_lo crc_hi>
 *         pkt_len = 3 + dataLen  (src + dst + cmd + data)
 *         CRC = (~sum(pkt_len..last_data_byte)) & 0xFFFF, little-endian
 *         ESC addr: 0x21 | BMS addr: 0x22
 *
 * !! VERIFY before use !!
 *   - M365 BMS payload field order / units depend on ESC firmware version.
 *     Capture traffic from a real M365 BMS with a logic analyzer and compare.
 *   - JBD current sign convention: some firmwares flip positive/negative for
 *     charge vs discharge. Check raw output with JBD PC software first.
 *   - The ESC may require more BMS packet types than just 0x01. Add them if
 *     the ESC shows a BMS-fault LED or won't engage throttle.
 */


#include <Arduino.h>
#if defined(ESP32) || defined(ESP32S3) || defined(ESP32C3)
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <Update.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <EEPROM.h>
#include <SoftwareSerial.h>
#include <Updater.h>
#endif

#if defined(ESP8266)
#define OTA_BEGIN_SIZE(size) (size)
#define OTA_ERROR_STRING() Update.getErrorString().c_str()
#else
#define OTA_BEGIN_SIZE(size) ((size) == 0 ? UPDATE_SIZE_UNKNOWN : (size))
#define OTA_ERROR_STRING() Update.errorString()
#endif

// ─── Pin config ───────────────────────────────────────────────────────────────
#include "pins.h"
#include "hardware.h"
#include "webserver_internal.h"
#include "protocol.h"

// ─── Timing ──────────────────────────────────────────────────────────────────
#define JBD_POLL_MS      500   // how often to poll the JBD BMS
#define M365_PUSH_MS     100   // how often to push battery status to ESC
#define JBD_TIMEOUT_MS   250   // max wait for JBD response

// ─── M365 addresses ──────────────────────────────────────────────────────────
#define ADDR_ESC  0x21
#define ADDR_BMS  0x22

// ─── JBD poll commands ───────────────────────────────────────────────────────
// CRC pre-calculated: 0x10000 - (0x03) = 0xFFFC? No:
//   Basic info cmd 0x03: data = none, so CRC covers [03 00] = sum 3, CRC = 0xFFFD
//   Cell info cmd  0x04: data = none, so CRC covers [04 00] = sum 4, CRC = 0xFFFC
static const uint8_t JBD_CMD_BASIC[] = {0xDD, 0xA5, 0x03, 0x00, 0xFF, 0xFD, 0x77};
static const uint8_t JBD_CMD_CELLS[] = {0xDD, 0xA5, 0x04, 0x00, 0xFF, 0xFC, 0x77};

BatteryState batt = {};

// ─── RX buffers ──────────────────────────────────────────────────────────────
static uint8_t jbdRxBuf[140];
static uint8_t jbdRxLen = 0;

static uint8_t m365RxBuf[64];
static uint8_t m365RxLen = 0;


// Control state
static volatile bool     btEnabled    = true;
static uint8_t           btReg        = 0xE1;   // JBD BT control register (firmware-dependent)
static volatile bool     escKill      = false;   // disable ESC by reporting zero SoC/voltage
static volatile bool     socSpoof     = false;   // report fixed SoC to M365 ESC
static volatile uint8_t  socSpoofVal  = 100;     // spoofed SoC %
static uint32_t          jbdPollMs    = JBD_POLL_MS; // runtime-configurable poll interval
static uint8_t           packCells    = 10;          // series cell count — maps real voltage to M365 10S range
static volatile bool     otaEnabled   = false;      // allow firmware updates through web interface
static volatile uint8_t  dashDriveMode = 1;        // X1 mode field: 0=stall,1=drive,2=eco stall,3=eco drive
static volatile bool     dashLightOn   = false;    // simulated dash light state
static volatile uint8_t  dashBattPct   = 100;      // dash battery percent for simulated frame
static volatile uint8_t  dashSpeedKmh  = 0;        // dash speed value for simulated frame
static volatile uint8_t  dashBeepAction = 0;        // X1 beep/action field for simulated frame

// ─── AP auto-shutdown ────────────────────────────────────────────────────────
// If no client connects within AP_IDLE_MS of boot, disable WiFi AP.
// Bridge continues running on stored settings.
#define AP_IDLE_MS        (2UL * 60UL * 1000UL)  // 2 minutes
static uint32_t apStartMs   = 0;

// ─── Web page ────────────────────────────────────────────────────────────────
// Served at /  — fetches /data JSON every second and updates in-place.
static const char HTML_PAGE[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>M365 Battery</title>
<style>
:root{--bg:#111;--card:#1c1c1c;--accent:#00c853;--warn:#ffab00;--err:#e53935;--text:#e0e0e0;--muted:#616161}
*{box-sizing:border-box;margin:0;padding:0}
body{background:var(--bg);color:var(--text);font-family:system-ui,sans-serif;padding:16px;max-width:600px;margin:0 auto}
h1{font-size:1.1rem;color:var(--accent);letter-spacing:.05em;text-transform:uppercase;margin-bottom:16px}
.grid{display:grid;grid-template-columns:repeat(auto-fill,minmax(130px,1fr));gap:10px;margin-bottom:14px}
.card{background:var(--card);border-radius:8px;padding:12px 14px}
.card .lbl{font-size:.65rem;color:var(--muted);text-transform:uppercase;letter-spacing:.08em}
.card .val{font-size:1.55rem;font-weight:700;line-height:1.2;margin-top:2px}
.card .unit{font-size:.75rem;color:var(--muted)}
.section{background:var(--card);border-radius:8px;padding:12px 14px;margin-bottom:14px}
.section .lbl{font-size:.65rem;color:var(--muted);text-transform:uppercase;letter-spacing:.08em;margin-bottom:8px}
.cells{display:grid;grid-template-columns:repeat(auto-fill,minmax(72px,1fr));gap:7px}
.cell{border-radius:6px;padding:7px 8px;text-align:center;font-size:.82rem;font-weight:600;background:#222}
.cell .cidx{font-size:.6rem;color:var(--muted);display:block;margin-bottom:2px}
.flags{display:flex;flex-wrap:wrap;gap:5px}
.flag{padding:3px 9px;border-radius:4px;font-size:.72rem;background:#252525;color:var(--muted)}
.flag.on{background:var(--err);color:#fff}
.foot{display:flex;align-items:center;gap:7px;font-size:.72rem;color:var(--muted)}
.dot{width:8px;height:8px;border-radius:50%;background:var(--muted);flex-shrink:0}
.dot.ok{background:var(--accent)}.dot.warn{background:var(--warn)}.dot.err{background:var(--err)}
.hdr{position:relative;margin-bottom:16px}
.gear{position:absolute;top:0;font-size:1.4rem;cursor:pointer;color:var(--muted);user-select:none;line-height:1}
.gear:hover{color:var(--text)}
.gear.test{right:2.8rem;}
.gear.settings{right:0;}
.overlay{display:none;position:fixed;inset:0;background:rgba(0,0,0,.75);z-index:10;align-items:center;justify-content:center}
.overlay.open{display:flex}
.modal{background:var(--card);border-radius:12px;padding:20px;width:min(360px,92vw);max-height:85vh;overflow-y:auto}
.mhdr{display:flex;align-items:center;justify-content:space-between;margin-bottom:16px}
.mhdr h2{font-size:.85rem;color:var(--accent);text-transform:uppercase;letter-spacing:.08em;margin:0}
.mcls{cursor:pointer;color:var(--muted);font-size:1.1rem}.mcls:hover{color:var(--text)}
.ssect{font-size:.6rem;color:var(--muted);text-transform:uppercase;letter-spacing:.1em;margin:14px 0 8px;border-top:1px solid #2a2a2a;padding-top:10px}
.ssect.first{margin-top:0;border-top:none}
.srow{display:flex;align-items:center;justify-content:space-between;gap:10px;margin-bottom:10px}
.slbl{font-size:.8rem}.ssub{font-size:.68rem;color:var(--muted);margin-top:1px}
.tgl{position:relative;width:40px;height:22px;flex-shrink:0}
.tgl input{opacity:0;width:0;height:0;position:absolute}
.tgl-sl{position:absolute;inset:0;border-radius:22px;background:#333;cursor:pointer;transition:.2s}
.tgl-sl:before{content:'';position:absolute;width:16px;height:16px;left:3px;bottom:3px;border-radius:50%;background:#fff;transition:.2s}
.tgl input:checked~.tgl-sl{background:var(--accent)}
.tgl input:checked~.tgl-sl:before{transform:translateX(18px)}
.tgl input.red:checked~.tgl-sl{background:var(--err)}
.sinp{background:#252525;border:1px solid #333;border-radius:5px;color:var(--text);padding:5px 8px;font-size:.8rem}
.sinp:focus{outline:none;border-color:var(--accent)}
.sapply{width:100%;margin-top:14px;padding:9px;border-radius:6px;border:none;background:var(--accent);color:#111;font-size:.85rem;font-weight:700;cursor:pointer}
.kbtn{width:100%;padding:10px;border-radius:6px;border:none;cursor:pointer;font-size:.88rem;font-weight:700;transition:background .2s,color .2s}
</style>
</head>
<body>
<div class="hdr">
  <h1 style="margin:0">M365 Battery Monitor</h1>
  <span class="gear test" onclick="document.getElementById('ov_test').classList.add('open')" title="Scooter Test">&#x1F6B2;</span>
  <span class="gear settings" onclick="document.getElementById('ov').classList.add('open')" title="Settings">&#9881;</span>
</div>
<div class="grid">
  <div class="card"><div class="lbl">Voltage</div><div class="val" id="volt">--</div><div class="unit">V</div></div>
  <div class="card"><div class="lbl">Current</div><div class="val" id="cur">--</div><div class="unit">A</div></div>
  <div class="card"><div class="lbl">SoC</div><div class="val" id="soc">--</div><div class="unit">%</div></div>
  <div class="card"><div class="lbl">Remaining</div><div class="val" id="rem">--</div><div class="unit">Ah</div></div>
  <div class="card"><div class="lbl">Nominal</div><div class="val" id="nom">--</div><div class="unit">Ah</div></div>
  <div class="card"><div class="lbl">Temperature</div><div class="val" id="temp">--</div><div class="unit">°C</div></div>
  <div class="card"><div class="lbl">Speed</div><div class="val" id="hb_speed">--</div><div class="unit">km/h</div></div>
  <div class="card"><div class="lbl">Avg Speed</div><div class="val" id="hb_speed_avg">--</div><div class="unit">km/h</div></div>
  <div class="card"><div class="lbl">Trip</div><div class="val" id="hb_trip">--</div><div class="unit">m</div></div>
  <div class="card"><div class="lbl">Total</div><div class="val" id="hb_total">--</div><div class="unit">m</div></div>
  <div class="card"><div class="lbl">ESC Temp</div><div class="val" id="hb_temp">--</div><div class="unit">°C</div></div>
  <div class="card"><div class="lbl">Uptime</div><div class="val" id="hb_uptime">--</div><div class="unit">sec</div></div>
</div>
<div class="section">
  <div class="lbl">Cell Voltages</div>
  <div class="cells" id="cells"></div>
</div>
<div class="section">
  <div class="lbl">Protection Flags</div>
  <div class="flags" id="flags"></div>
</div>
<div class="section" style="margin-bottom:14px">
  <div class="lbl">Controls</div>
  <button id="kbtn" onclick="toggleKill()" class="kbtn" style="background:#2a2a2a;color:var(--muted)">&#9889; ESC Kill: OFF</button>
</div>
<div class="overlay" id="ov" onclick="if(event.target===this)this.classList.remove('open')">
<div class="modal">
  <div class="mhdr"><h2>Settings</h2><span class="mcls" onclick="document.getElementById('ov').classList.remove('open')">&#x2715;</span></div>
  <div class="ssect first">WiFi AP</div>
  <div class="srow" style="flex-direction:column;align-items:flex-start;gap:4px">
    <div class="slbl">Network Name (SSID)</div>
    <input class="sinp" type="text" id="s-ssid" maxlength="32" style="width:100%">
  </div>
  <div class="srow" style="flex-direction:column;align-items:flex-start;gap:4px">
    <div class="slbl">Password <span class="ssub">(min 8 chars &#8212; blank = keep current)</span></div>
    <input class="sinp" type="password" id="s-pass" maxlength="63" placeholder="unchanged" style="width:100%">
  </div>
  <div class="ssect">BMS Protocol</div>
  <select class="sinp" disabled style="width:100%">
    <option selected>JBD / Overkill Solar</option>
    <option>DALY (coming soon)</option>
    <option>JIKONG / ANT (coming soon)</option>
  </select>
  <div class="ssect">BMS Control</div>
  <div class="srow">
    <div><div class="slbl">Bluetooth</div><div class="ssub">JBD onboard BT module</div></div>
    <label class="tgl"><input type="checkbox" id="s-bt" checked><span class="tgl-sl"></span></label>
  </div>
  <div class="srow" style="flex-direction:column;align-items:flex-start;gap:4px">
    <div class="slbl">BT Register <span class="ssub">(hex &#8212; varies by firmware)</span></div>
    <input class="sinp" type="text" id="s-btreg" value="E1" maxlength="2" style="width:64px;font-family:monospace;text-transform:uppercase">
  </div>
  <div class="srow">
    <div><div class="slbl">Poll interval</div><div class="ssub">JBD query rate</div></div>
    <select class="sinp" id="s-poll">
      <option value="200">200 ms</option>
      <option value="500" selected>500 ms</option>
      <option value="1000">1 s</option>
      <option value="2000">2 s</option>
    </select>
  </div>
  <div class="ssect">ESC Control</div>
  <div class="srow">
    <div><div class="slbl">Pack Cells (S)</div><div class="ssub">Real cell count &#8212; voltage mapped to M365 10S range</div></div>
    <select class="sinp" id="s-packcells">
      <option value="7">7S</option><option value="8">8S</option><option value="9">9S</option>
      <option value="10" selected>10S (stock)</option><option value="11">11S</option>
      <option value="12">12S</option><option value="13">13S</option><option value="14">14S</option>
      <option value="15">15S</option><option value="16">16S</option>
    </select>
  </div>
  <div class="srow">
    <div><div class="slbl">ESC Kill</div><div class="ssub">Report fault &#8594; motor disabled</div></div>
    <label class="tgl"><input type="checkbox" id="s-kill" class="red"><span class="tgl-sl"></span></label>
  </div>
  <div class="srow">
    <div><div class="slbl">SoC Override</div><div class="ssub">Report fixed SoC to ESC (affects speed limit)</div></div>
    <label class="tgl"><input type="checkbox" id="s-spoof"><span class="tgl-sl"></span></label>
  </div>
  <div class="srow" style="flex-direction:column;align-items:stretch;gap:4px">
    <div style="display:flex;justify-content:space-between;font-size:.8rem"><span>SoC Value</span><span id="s-spoof-lbl">100%</span></div>
    <input type="range" id="s-spoofval" min="0" max="100" value="100" style="accent-color:var(--accent)">
  </div>
  <div class="ssect">OTA Updates</div>
  <div class="srow">
    <div><div class="slbl">Firmware uploads</div><div class="ssub">Enable web-based OTA firmware updates</div></div>
    <label class="tgl"><input type="checkbox" id="s-ota"><span class="tgl-sl"></span></label>
  </div>
  <div class="srow" style="flex-direction:column;align-items:flex-start;gap:4px">
    <div class="ssub">When enabled, visit <a href="/update" target="_blank" style="color:var(--accent)">/update</a> to upload firmware.</div>
  </div>
  <button class="sapply" onclick="applySettings()">Apply</button>
</div></div>
<div class="overlay" id="ov_test" onclick="if(event.target===this)this.classList.remove('open')">
<div class="modal">
  <div class="mhdr"><h2>Scooter Test</h2><span class="mcls" onclick="document.getElementById('ov_test').classList.remove('open')">&#x2715;</span></div>
  <div class="srow" style="flex-wrap:wrap;gap:10px;margin-bottom:10px;">
    <button class="sapply" style="flex:1 1 48%;" onclick="sendScooterCmd('cruise_on')">Cruise ON</button>
    <button class="sapply" style="flex:1 1 48%;" onclick="sendScooterCmd('cruise_off')">Cruise OFF</button>
  </div>
  <div class="srow" style="flex-wrap:wrap;gap:10px;margin-bottom:10px;">
    <button class="sapply" style="flex:1 1 48%;" onclick="sendScooterCmd('lights_on')">Lights ON</button>
    <button class="sapply" style="flex:1 1 48%;" onclick="sendScooterCmd('lights_off')">Lights OFF</button>
  </div>
  <div class="srow" style="flex-wrap:wrap;gap:10px;margin-bottom:10px;">
    <button class="sapply" style="flex:1 1 32%;" onclick="sendScooterCmd('regen_0')">Regen 0</button>
    <button class="sapply" style="flex:1 1 32%;" onclick="sendScooterCmd('regen_1')">Regen 1</button>
    <button class="sapply" style="flex:1 1 32%;" onclick="sendScooterCmd('regen_2')">Regen 2</button>
  </div>
  <div class="srow" style="flex-wrap:wrap;gap:10px;margin-bottom:10px;">
    <button class="sapply" style="flex:1 1 32%;" onclick="sendScooterCmd('dash_mode_0')">Mode 0</button>
    <button class="sapply" style="flex:1 1 32%;" onclick="sendScooterCmd('dash_mode_1')">Mode 1</button>
    <button class="sapply" style="flex:1 1 32%;" onclick="sendScooterCmd('dash_mode_2')">Mode 2</button>
  </div>
  <div class="srow" style="flex-wrap:wrap;gap:10px;margin-bottom:10px;">
    <button class="sapply" style="flex:1 1 48%;" onclick="sendScooterCmd('dash_light_on')">Dash Lights ON</button>
    <button class="sapply" style="flex:1 1 48%;" onclick="sendScooterCmd('dash_light_off')">Dash Lights OFF</button>
  </div>
  <div class="srow" style="flex-direction:column;align-items:flex-start;gap:8px">
    <div class="slbl">Experimental scooter/dash test</div>
    <div class="ssub">These buttons send test packets on the M365 UART. Dash/display commands are experimental and may not reach the internal controller.</div>
    <div class="ssub">Current dash state: <span id="dash-mode-label">Mode 1</span>, <span id="dash-light-label">Lights OFF</span></div>
  </div>
</div></div>
<div class="foot"><div class="dot" id="dot"></div><span id="status">connecting&#x2026;</span></div>
<script>
const PROT=['Cell OV','Cell UV','Pack OV','Pack UV','Chg OC','Dis OC','Short','IC Err','SW Lock'];
function cellColor(mv){
  if(mv<3000)return'#e53935';
  if(mv<3300)return'#ff6f00';
  if(mv<4050)return'#00c853';
  if(mv<=4200)return'#ffab00';
  return'#e53935';
}
function fmt(v,d=2){return isNaN(v)?'--':v.toFixed(d);}
function render(d){
  document.getElementById('volt').textContent=fmt(d.voltage_mv/1000);
  const curA=d.current_ma/1000;
  const curEl=document.getElementById('cur');
  curEl.textContent=(curA>=0?'+':'')+fmt(curA);
  curEl.style.color=curA>0?'var(--warn)':curA<0?'#4fc3f7':'var(--text)';
  document.getElementById('soc').textContent=d.soc_pct;
  document.getElementById('rem').textContent=fmt(d.remaining_mah/1000);
  document.getElementById('nom').textContent=fmt(d.nominal_mah/1000);
  const t=d.temps.map(x=>fmt(x/10,1));
  document.getElementById('temp').textContent=t.length?t.join(' / '):'--';
  // Heartbeat fetch
  fetch('/heartbeat').then(r=>r.ok?r.json():null).then(hb=>{
    if(hb){
      document.getElementById('hb_speed').textContent=fmt(hb.speed_kmh,1);
      document.getElementById('hb_speed_avg').textContent=fmt(hb.speed_average_kmh,1);
      document.getElementById('hb_trip').textContent=hb.trip_distance_m;
      document.getElementById('hb_total').textContent=hb.total_distance_m;
      document.getElementById('hb_temp').textContent=fmt(hb.frame_temperature,1);
      document.getElementById('hb_uptime').textContent=hb.uptime_s;
    }else{
      document.getElementById('hb_speed').textContent='--';
      document.getElementById('hb_speed_avg').textContent='--';
      document.getElementById('hb_trip').textContent='--';
      document.getElementById('hb_total').textContent='--';
      document.getElementById('hb_temp').textContent='--';
      document.getElementById('hb_uptime').textContent='--';
    }
  });
  const ce=document.getElementById('cells');
  ce.innerHTML='';
  d.cells.forEach((mv,i)=>{
    const el=document.createElement('div');
    el.className='cell';
    el.style.borderBottom='3px solid '+cellColor(mv);
    el.innerHTML='<span class="cidx">C'+(i+1)+'</span>'+fmt(mv/1000,3);
    ce.appendChild(el);
  });
  const fl=document.getElementById('flags');
  fl.innerHTML='';
  PROT.forEach((name,i)=>{
    const el=document.createElement('span');
    el.className='flag'+((d.prot_status>>i)&1?' on':'');
    el.textContent=name;
    fl.appendChild(el);
  });
  const dot=document.getElementById('dot');
  const stxt=document.getElementById('status');
  if(!d.valid){dot.className='dot err';stxt.textContent='No BMS data';}
  else if(d.prot_status){dot.className='dot warn';stxt.textContent='Protection active (0x'+d.prot_status.toString(16).toUpperCase()+')';}
  else{dot.className='dot ok';stxt.textContent='OK';}
  syncSettings(d);
}
async function poll(){
  try{
    const r=await fetch('/data');
    if(!r.ok)throw new Error(r.status);
    render(await r.json());
  }catch(e){
    document.getElementById('dot').className='dot err';
    document.getElementById('status').textContent='Connection lost';
  }
  setTimeout(poll,1000);
}
poll();
function syncSettings(d){
  // Always update the quick-access kill button on the main page
  if(d.esc_kill!=null){
    const kb=document.getElementById('kbtn');
    if(kb){kb.textContent=d.esc_kill?'\u26a1 ESC Kill: ON':'\u26a1 ESC Kill: OFF';kb.style.background=d.esc_kill?'var(--err)':'#2a2a2a';kb.style.color=d.esc_kill?'#fff':'var(--muted)';}
  }
  // Don't overwrite modal fields while the modal is open — user may be editing
  if(document.getElementById('ov').classList.contains('open')) return;
  if(d.bt_enabled!=null) document.getElementById('s-bt').checked=d.bt_enabled;
  if(d.bt_reg!=null) document.getElementById('s-btreg').value=d.bt_reg.toString(16).toUpperCase().padStart(2,'0');
  if(d.esc_kill!=null) document.getElementById('s-kill').checked=d.esc_kill;
  if(d.soc_spoof!=null) document.getElementById('s-spoof').checked=d.soc_spoof;
  if(d.soc_spoof_val!=null){const v=d.soc_spoof_val;document.getElementById('s-spoofval').value=v;document.getElementById('s-spoof-lbl').textContent=v+'%';}
  if(d.poll_ms!=null){const sel=document.getElementById('s-poll');for(const o of sel.options)if(parseInt(o.value)===d.poll_ms){o.selected=true;break;}}
  if(d.pack_cells!=null){const sel=document.getElementById('s-packcells');for(const o of sel.options)if(parseInt(o.value)===d.pack_cells){o.selected=true;break;}}
  if(d.ota_enabled!=null) document.getElementById('s-ota').checked=d.ota_enabled;
  if(d.wifi_ssid!=null) document.getElementById('s-ssid').value=d.wifi_ssid;
  if(d.dash_drive_mode!=null){
    const modeLabels = ['Mode 0','Mode 1','Mode 2'];
    document.getElementById('dash-mode-label').textContent = modeLabels[d.dash_drive_mode] || ('Mode ' + d.dash_drive_mode);
  }
  if(d.dash_light_on!=null){
    document.getElementById('dash-light-label').textContent = d.dash_light_on ? 'Lights ON' : 'Lights OFF';
  }
}
async function applySettings(){
  const body=new URLSearchParams({
    bt:document.getElementById('s-bt').checked?'1':'0',
    btReg:document.getElementById('s-btreg').value,
    escKill:document.getElementById('s-kill').checked?'1':'0',
    socSpoof:document.getElementById('s-spoof').checked?'1':'0',
    socSpoofVal:document.getElementById('s-spoofval').value,
    pollMs:document.getElementById('s-poll').value,
    packCells:document.getElementById('s-packcells').value,
    otaEnabled:document.getElementById('s-ota').checked?'1':'0',
    apSsid:document.getElementById('s-ssid').value,
    apPass:document.getElementById('s-pass').value
  });
  try{
    const wifiChanged=document.getElementById('s-pass').value.length>=8||document.getElementById('s-ssid').value!=='';
