The-Nicolini/M365-JBD-BATTERY-BRIDGE-ESP32/src/main.cpp
    const r=await fetch('/settings',{method:'POST',body:body.toString(),headers:{'Content-Type':'application/x-www-form-urlencoded'}});
    const d=await r.json();
    syncSettings(d);
    document.getElementById('ov').classList.remove('open');
    if(wifiChanged&&(document.getElementById('s-pass').value.length>=8))alert('WiFi password changed.\nReconnect to "'+(d.wifi_ssid||document.getElementById('s-ssid').value)+'" with the new password.');
    document.getElementById('s-pass').value='';
  }catch(e){}
}
async function sendScooterCmd(action){
  try{
    const r=await fetch('/scooter',{method:'POST',body:new URLSearchParams({action})});
    if(!r.ok) throw new Error(await r.text());
    const d=await r.json();
    alert('Scooter command sent: '+d.action);
  }catch(e){
    alert('Scooter command failed: '+e.message);
  }
}
async function toggleKill(){
  try{const r=await fetch('/kill',{method:'POST'});syncSettings(await r.json());}catch(e){}
}
document.getElementById('s-spoofval').addEventListener('input',function(){
  document.getElementById('s-spoof-lbl').textContent=this.value+'%';
});
</script>
</body>
</html>
)rawliteral";

// Forward declaration
static uint16_t jbdCrc(const uint8_t* data, uint8_t len);

// ─── JBD write helper ───────────────────────────────────────────────────────
// Write format: DD 5A <reg> <len> <data...> <crc_hi> <crc_lo> 77
// CRC covers [reg, len, data...]
static void sendJbdWrite(uint8_t reg, const uint8_t* data, uint8_t len) {
    // Unlock with default password 0x0000
    // CRC of [0x00, 0x02, 0x00, 0x00] = 0xFFFE
    static const uint8_t unlock[] = {0xDD, 0x5A, 0x00, 0x02, 0x00, 0x00, 0xFF, 0xFE, 0x77};
    while (jbdSerial.available()) jbdSerial.read();  // flush
    jbdSerial.write(unlock, sizeof(unlock));
    delay(60);
    while (jbdSerial.available()) jbdSerial.read();  // flush response

    // Build write packet
    uint8_t buf[32];
    buf[0] = 0xDD;
    buf[1] = 0x5A;
    buf[2] = reg;
    buf[3] = len;
    if (len > 0) memcpy(&buf[4], data, len);

    // CRC covers [reg, len, data...]
    uint8_t crcIn[32];
    crcIn[0] = reg;
    crcIn[1] = len;
    if (len > 0) memcpy(&crcIn[2], data, len);
    uint16_t crc = jbdCrc(crcIn, 2 + len);
    buf[4 + len] = (crc >> 8) & 0xFF;
    buf[5 + len] =  crc       & 0xFF;
    buf[6 + len] = 0x77;
    jbdSerial.write(buf, 7 + len);
    delay(60);
    while (jbdSerial.available()) jbdSerial.read();  // flush response
}

// ─── POST /bt — toggle JBD BMS Bluetooth ─────────────────────────────────────
// !! Register 0xE1 is commonly cited for JBD BT control but is firmware-dependent.
// !! Verify with a logic analyser or JBD PC software for your specific BMS.
void handleBtToggle() {
    btEnabled = !btEnabled;
    uint8_t val = btEnabled ? 0x01 : 0x00;
    sendJbdWrite(btReg, &val, 1);  // 0x01 = BT on, 0x00 = BT off
    Serial.printf("[BT] BMS Bluetooth %s\n", btEnabled ? "ON" : "OFF");
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send(200, "application/json",
        String("{\"bt\":") + (btEnabled ? "true" : "false") + "}");
}


// ─── POST /kill — toggle ESC kill ───────────────────────────────────────────────────
static void buildSettingsJson(String& j) {
    j += "\"bt_enabled\":"    + String(btEnabled    ? "true" : "false");
    j += ",\"bt_reg\":"        + String(btReg);
    j += ",\"esc_kill\":"      + String(escKill      ? "true" : "false");
    j += ",\"soc_spoof\":"     + String(socSpoof     ? "true" : "false");
    j += ",\"soc_spoof_val\":" + String(socSpoofVal);
    j += ",\"poll_ms\":"       + String(jbdPollMs);
    j += ",\"pack_cells\":"    + String(packCells);
    j += ",\"ota_enabled\":"   + String(otaEnabled   ? "true" : "false");
    j += ",\"dash_drive_mode\":"+ String(dashDriveMode);
    j += ",\"dash_light_on\":"  + String(dashLightOn  ? "true" : "false");
    j += ",\"dash_batt_pct\":"  + String(dashBattPct);
    j += ",\"dash_speed_kmh\":" + String(dashSpeedKmh);
    j += ",\"wifi_ssid\":\""        + String(apSsid)                              + "\"";
}

static uint16_t dashFrameCrc(uint8_t len, const uint8_t* data) {
    uint32_t sum = len;
    for (uint8_t i = 0; i < 7; i++) sum += data[i];
    return (uint16_t)sum ^ 0xFFFF;
}

static uint8_t buildDashFrame(uint8_t* out, uint8_t battPct, uint8_t speedKmh, uint8_t driveMode, bool lightOn, uint8_t beepAction) {
    // X1-style frame for source 0x21, type 0x64
    // Body payload fields: mode, battleds, light, beepaction
    (void)speedKmh;
    uint8_t leds = (battPct >= 100) ? 5 : (battPct / 20);
    if (leds > 5) leds = 5;
    uint8_t N = lightOn ? 0x64 : 0x00;
    uint8_t B = beepAction;
    const uint8_t LEN = 6;
    uint8_t body[7];
    body[0] = 0x21;
    body[1] = 0x64;
    body[2] = 0x00;
    body[3] = driveMode;
    body[4] = leds;
    body[5] = N;
    body[6] = B;
    uint16_t crc = dashFrameCrc(LEN, body);
    out[0] = 0x55;
    out[1] = 0xAA;
    out[2] = LEN;
    memcpy(&out[3], body, sizeof(body));
    out[10] = crc & 0xFF;
    out[11] = (crc >> 8) & 0xFF;
    return 12;
}

void handleKillToggle() {
    escKill = !escKill;
    Serial.printf("[Kill] ESC Kill %s\n", escKill ? "ON" : "OFF");
    String j = "{";
    buildSettingsJson(j);
    j += "}";
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send(200, "application/json", j);
}

// ─── POST /settings — apply settings from modal ───────────────────────────────────
void handleSettings() {
    if (webServer.hasArg("bt")) {
        bool newBt = webServer.arg("bt") == "1";
        if (newBt != btEnabled) {
            btEnabled = newBt;
            uint8_t val = btEnabled ? 0x01 : 0x00;
            sendJbdWrite(btReg, &val, 1);
            Serial.printf("[Settings] BT %s\n", btEnabled ? "ON" : "OFF");
        }
    }
    if (webServer.hasArg("btReg")) {
        uint8_t r = (uint8_t)strtol(webServer.arg("btReg").c_str(), nullptr, 16);
        if (r != 0) btReg = r;
    }
    if (webServer.hasArg("escKill"))  escKill     = webServer.arg("escKill")  == "1";
    if (webServer.hasArg("socSpoof")) socSpoof    = webServer.arg("socSpoof") == "1";
    if (webServer.hasArg("socSpoofVal")) {
        int v = webServer.arg("socSpoofVal").toInt();
        socSpoofVal = (uint8_t)constrain(v, 0, 100);
    }
    if (webServer.hasArg("pollMs")) {
        int ms = webServer.arg("pollMs").toInt();
        if (ms >= 200 && ms <= 5000) jbdPollMs = (uint32_t)ms;
    }
    if (webServer.hasArg("packCells")) {
        int c = webServer.arg("packCells").toInt();
        if (c >= 1 && c <= 24) packCells = (uint8_t)c;
    }
    if (webServer.hasArg("apSsid")) {
        String s = webServer.arg("apSsid");
        s.trim();
        if (s.length() >= 1 && s.length() <= 32) {
            strlcpy(apSsid, s.c_str(), sizeof(apSsid));
#if defined(ESP32) || defined(ESP32S3) || defined(ESP32C3)
            prefs.putString("ssid", apSsid);
#endif
            apRestartPending = true;
        }
    }
    if (webServer.hasArg("apPass")) {
        String p = webServer.arg("apPass");
        if (p.length() >= 8 && p.length() <= 63) {
            strlcpy(apPass, p.c_str(), sizeof(apPass));
#if defined(ESP32) || defined(ESP32S3) || defined(ESP32C3)
            prefs.putString("pass", apPass);
#endif
            apRestartPending = true;
        }
    }
    if (webServer.hasArg("otaEnabled")) {
        otaEnabled = webServer.arg("otaEnabled") == "1";
#if defined(ESP32) || defined(ESP32S3) || defined(ESP32C3)
        prefs.putBool("ota", otaEnabled);
#endif
        Serial.printf("[Settings] OTA updates %s\n", otaEnabled ? "ENABLED" : "DISABLED");
    }
    Serial.printf("[Settings] kill=%d spoof=%d(%d%%) poll=%ums cells=%dS ssid=%s\n",
        escKill, socSpoof, socSpoofVal, jbdPollMs, packCells, apSsid);
    String j = "{";
    buildSettingsJson(j);
    j += "}";
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send(200, "application/json", j);
}

void handleOtaPage() {
    if (!otaEnabled) {
        webServer.send(404, "text/plain", "OTA updates are disabled.");
        return;
    }
    String html = "<!DOCTYPE html><html><head><meta charset='UTF-8'><title>OTA Firmware Upload</title></head>"
                  "<body style='background:#111;color:#eee;font-family:system-ui,sans-serif;padding:20px;'>"
                  "<h1>OTA Firmware Upload</h1>"
                  "<p>Upload a new firmware binary. Device will reboot automatically when the update finishes.</p>"
                  "<form method='POST' action='/update' enctype='multipart/form-data'>"
                  "<input type='file' name='update' accept='.bin' required style='margin-bottom:12px;display:block;'>"
                  "<button type='submit' style='padding:10px 16px;border:none;border-radius:6px;background:#00c853;color:#111;font-weight:700;cursor:pointer;'>Upload</button>"
                  "</form></body></html>";
    webServer.send(200, "text/html", html);
}

void handleOtaUpload() {
    static bool otaStarted = false;
    if (!otaEnabled) return;
    HTTPUpload& upload = webServer.upload();
    if (upload.status == UPLOAD_FILE_START) {
        otaStarted = false;
        size_t size = upload.totalSize;
        Serial.printf("[OTA] Upload start: %s (%u bytes)\n", upload.filename.c_str(), size);
        if (size == 0) {
            Serial.println("[OTA] begin failed: missing upload size");
            return;
        }
        otaStarted = Update.begin(OTA_BEGIN_SIZE(size));
        if (!otaStarted) {
            Serial.printf("[OTA] begin failed: %s\n", OTA_ERROR_STRING());
        }
    } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (!otaStarted) return;
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
            Serial.printf("[OTA] write failed: %s\n", OTA_ERROR_STRING());
            otaStarted = false;
        }
    } else if (upload.status == UPLOAD_FILE_END) {
        if (!otaStarted) {
            Serial.println("[OTA] Update aborted: start failed");
            return;
        }
        if (Update.end(true)) {
            Serial.printf("[OTA] Update complete: %u bytes\n", upload.totalSize);
        } else {
            Serial.printf("[OTA] Update failed: %s\n", OTA_ERROR_STRING());
        }
        otaStarted = false;
    } else if (upload.status == UPLOAD_FILE_ABORTED) {
        Update.end();
        otaStarted = false;
        Serial.println("[OTA] Upload aborted");
    }
}

void handleOtaUpdate() {
    if (!otaEnabled) {
        webServer.send(403, "text/plain", "OTA updates are disabled.");
        return;
    }
    if (Update.hasError()) {
        webServer.send(500, "text/plain", "OTA update failed. Check serial log for details.");
        return;
    }
    webServer.sendHeader("Connection", "close");
    webServer.send(200, "text/plain", "Update successful. Rebooting...");
    delay(100);
    ESP.restart();
}

void handleScooterCmd() {
    if (!webServer.hasArg("action")) {
        webServer.send(400, "application/json", "{\"error\":\"missing action\"}");
        return;
    }
    String action = webServer.arg("action");
    uint8_t buf[16];
    uint8_t len = 0;

    dashBattPct = socSpoof ? socSpoofVal : batt.soc_pct;
    int speed = (int)round(lastMotorInfo.speed_kmh);
    dashSpeedKmh = (uint8_t)constrain(speed < 0 ? 0 : speed, 0, 255);

    if (action == "cruise_on") {
        len = build_write_cruise(buf, true);
    } else if (action == "cruise_off") {
        len = build_write_cruise(buf, false);
    } else if (action == "lights_on") {
        len = build_write_led(buf, true);
    } else if (action == "lights_off") {
        len = build_write_led(buf, false);
    } else if (action == "regen_0") {
        len = build_write_regen(buf, 0);
    } else if (action == "regen_1") {
        len = build_write_regen(buf, 1);
    } else if (action == "regen_2") {
        len = build_write_regen(buf, 2);
    } else if (action == "dash_mode_0") {
        dashDriveMode = 0;
        len = buildDashFrame(buf, dashBattPct, dashSpeedKmh, dashDriveMode, dashLightOn, dashBeepAction);
    } else if (action == "dash_mode_1") {
        dashDriveMode = 1;
        len = buildDashFrame(buf, dashBattPct, dashSpeedKmh, dashDriveMode, dashLightOn, dashBeepAction);
    } else if (action == "dash_mode_2") {
        dashDriveMode = 2;
        len = buildDashFrame(buf, dashBattPct, dashSpeedKmh, dashDriveMode, dashLightOn, dashBeepAction);
    } else if (action == "dash_light_on") {
        dashLightOn = true;
        len = buildDashFrame(buf, dashBattPct, dashSpeedKmh, dashDriveMode, dashLightOn, dashBeepAction);
    } else if (action == "dash_light_off") {
        dashLightOn = false;
        len = buildDashFrame(buf, dashBattPct, dashSpeedKmh, dashDriveMode, dashLightOn, dashBeepAction);
    } else {
        webServer.send(400, "application/json", "{\"error\":\"unknown action\"}");
        return;
    }

    if (len > 0) {
        m365Serial.write(buf, len);
        webServer.sendHeader("Cache-Control", "no-cache");
        webServer.send(200, "application/json", String("{\"ok\":true,\"action\":\"") + action + "\",\"dash_drive_mode\":" + String(dashDriveMode) + ",\"dash_light_on\":" + String(dashLightOn ? "true" : "false") + "}");
    } else {
        webServer.send(500, "application/json", "{\"error\":\"failed to build command\"}");
    }
}

// ─── /data — JSON battery snapshot ───────────────────────────────────────────
void handleData() {
    String j = "{";
    j += "\"valid\":"         + String(batt.valid ? "true" : "false");
    j += ",\"voltage_mv\":"    + String(batt.voltage_mv);
    j += ",\"current_ma\":"    + String(batt.current_ma);
    j += ",\"soc_pct\":"       + String(batt.soc_pct);
    j += ",\"remaining_mah\":" + String(batt.remaining_mah);
    j += ",\"nominal_mah\":"   + String(batt.nominal_mah);
    j += ",\"prot_status\":"   + String(batt.prot_status);
    j += ",\"ntc_count\":"     + String(batt.ntc_count);
    j += "\"temps\":[";
    for (uint8_t i = 0; i < batt.ntc_count; i++) {
        if (i) j += ",";
        j += String(batt.temp_c10[i]);
    }
    j += "],\"cell_count\":";
    j += String(batt.cell_count);
    j += ",\"cells\":[";
    uint8_t n = (batt.cell_count > 20) ? 20 : batt.cell_count;
    for (uint8_t i = 0; i < n; i++) {
        if (i) j += ",";
        j += String(batt.cell_mv[i]);
    }
    j += "],";
    buildSettingsJson(j);
    j += "}";
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send(200, "application/json", j);
}

// ─── / — HTML dashboard ───────────────────────────────────────────────────────
void handleRoot() {
    webServer.sendHeader("Cache-Control", "no-cache");
    webServer.send_P(200, "text/html", HTML_PAGE);
}

// ─── JBD helpers ─────────────────────────────────────────────────────────────

/**
 * Compute JBD checksum for an outgoing command.
 * Covers: [cmd, 0x00] (the two bytes after 0xA5 for a read command).
 * For commands with data payload the sum covers those bytes too.
 */
static uint16_t jbdCrc(const uint8_t* data, uint8_t len) {
    uint16_t sum = 0;
    for (uint8_t i = 0; i < len; i++) sum += data[i];
    return (0x10000 - sum) & 0xFFFF;
}

/**
 * Read JBD response into jbdRxBuf.
 * Returns true when end marker 0x77 is received within timeout.
 */
static bool readJbdResponse() {
    jbdRxLen = 0;
    uint32_t t0 = millis();
    while (millis() - t0 < JBD_TIMEOUT_MS) {
        while (jbdSerial.available() && jbdRxLen < sizeof(jbdRxBuf)) {
            jbdRxBuf[jbdRxLen++] = (uint8_t)jbdSerial.read();
            // End-of-packet marker
            if (jbdRxLen >= 7 && jbdRxBuf[jbdRxLen - 1] == 0x77) return true;
        }
    }
    return false;
}

/**
 * Parse JBD 0x03 basic-info response.
 * Packet layout (after 0xDD start byte):
 *   [0] 0xDD  [1] 0x03  [2] 0x00 (OK)  [3] dataLen
 *   [4..4+dataLen-1] data
 *   [4+dataLen] crc_hi  [4+dataLen+1] crc_lo  [4+dataLen+2] 0x77
 */
static bool parseJbdBasicInfo(const uint8_t* buf, uint8_t len) {
    if (len < 8)           return false;
    if (buf[0] != 0xDD)    return false;
    if (buf[1] != 0x03)    return false;
    if (buf[2] != 0x00)    return false;  // 0x80 = error response

