The-Nicolini/M365-JBD-BATTERY-BRIDGE-ESP32/src/main.cpp
    uint8_t dataLen = buf[3];
    if (len < (uint16_t)(dataLen + 7)) return false;
    if (buf[dataLen + 6] != 0x77)      return false;
    if (dataLen < 24)                  return false;

    const uint8_t* d = &buf[4];

    // Verify CRC
    uint16_t crc_calc = jbdCrc(d, dataLen);
    uint16_t crc_recv = ((uint16_t)d[dataLen] << 8) | d[dataLen + 1];
    if (crc_calc != crc_recv) {
        Serial.printf("[JBD] Basic info CRC mismatch: calc=%04X recv=%04X\n", crc_calc, crc_recv);
        return false;
    }

    // JBD units: voltage = 10 mV, current = 10 mA (signed), capacity = 10 mAh
    batt.voltage_mv    = (uint16_t)(((uint16_t)d[0] << 8) | d[1]) * 10;
    int16_t raw_cur    = (int16_t)(((uint16_t)d[2] << 8) | d[3]);
    batt.current_ma    = (int16_t)((int32_t)raw_cur * 10);
    batt.remaining_mah = (uint16_t)(((uint16_t)d[4] << 8) | d[5]) * 10;
    batt.nominal_mah   = (uint16_t)(((uint16_t)d[6] << 8) | d[7]) * 10;
    batt.prot_status   = ((uint16_t)d[16] << 8) | d[17];
    batt.soc_pct       = d[19];
    batt.cell_count    = d[21];
    batt.ntc_count     = d[22];
    if (batt.ntc_count > 3) batt.ntc_count = 3;

    for (uint8_t i = 0; i < batt.ntc_count; i++) {
        if ((23 + i * 2 + 1) >= dataLen) break;
        uint16_t raw_t = ((uint16_t)d[23 + i * 2] << 8) | d[24 + i * 2];
        batt.temp_c10[i] = (int16_t)(raw_t - 2731);  // 0.1 K -> 0.1 °C
    }

    batt.valid = true;
    return true;
}

/**
 * Parse JBD 0x04 cell-voltage response.
 * Each cell voltage is a big-endian uint16 in mV.
 */
static bool parseJbdCellInfo(const uint8_t* buf, uint8_t len) {
    if (len < 8)           return false;
    if (buf[0] != 0xDD)    return false;
    if (buf[1] != 0x04)    return false;
    if (buf[2] != 0x00)    return false;

    uint8_t dataLen = buf[3];
    if (len < (uint16_t)(dataLen + 7)) return false;

    const uint8_t* d = &buf[4];
    uint8_t cells = dataLen / 2;
    if (cells > 20) cells = 20;
    batt.cell_count = cells;

    for (uint8_t i = 0; i < cells; i++) {
        batt.cell_mv[i] = ((uint16_t)d[i * 2] << 8) | d[i * 2 + 1];
    }
    return true;
}

// ─── M365 packet helpers ─────────────────────────────────────────────────────

/**
 * Compute M365 packet CRC.
 * Input: pointer to pkt_len byte through last data byte.
 * CRC = bitwise NOT of 16-bit sum, little-endian.
 */
static uint16_t m365Crc(const uint8_t* start, uint8_t count) {
    uint16_t sum = 0;
    for (uint8_t i = 0; i < count; i++) sum += start[i];
    return (~sum) & 0xFFFF;
}

/**
 * Build an M365 packet into out[].
 * Format: 55 AA <pkt_len> <src> <dst> <cmd> [data*dataLen] <crc_lo> <crc_hi>
 * pkt_len = 3 + dataLen (src + dst + cmd + data bytes)
 * Returns total byte count.
 */
static uint8_t buildM365Packet(uint8_t* out, uint8_t src, uint8_t dst,
                                uint8_t cmd, const uint8_t* data, uint8_t dataLen) {
    out[0] = 0x55;
    out[1] = 0xAA;
    out[2] = 3 + dataLen;    // pkt_len
    out[3] = src;
    out[4] = dst;
    out[5] = cmd;
    if (dataLen > 0) memcpy(&out[6], data, dataLen);

    uint16_t crc = m365Crc(&out[2], 4 + dataLen);  // from pkt_len byte
    out[6 + dataLen] = crc & 0xFF;
    out[7 + dataLen] = (crc >> 8) & 0xFF;

    return 8 + dataLen;
}

/**
 * Build the standard BMS status packet (BMS->ESC, cmd 0x01).
 *
 * !! Field order / units below are from community reverse engineering !!
 * !! Verify against a logic-analyzer capture of your M365 BMS !!
 *
 * Typical M365 BMS status payload (10 bytes):
 *   [0]    SoC %  (uint8)
 *   [1-2]  Pack voltage in 10 mV units (uint16 LE)
 *   [3-4]  Current in mA signed (int16 LE), negative = charging
 *   [5-6]  Temperature of NTC1 in 0.1 °C (int16 LE)
 *   [7-8]  Remaining capacity mAh (uint16 LE)
 *   [9]    Number of cells (uint8)
 */
uint8_t buildBmsStatusPacket(uint8_t* out) {
    uint8_t payload[10];

    // Apply ESC kill (zero SoC+voltage) or SoC spoof override
    uint8_t  effSoc = escKill ? 0 : (socSpoof ? socSpoofVal : batt.soc_pct);
    payload[0] = effSoc;

    // Map real pack voltage → 10S Li-ion ESC range (30–42 V).
    // Per-cell: 3.0 V = empty, 4.2 V = full.  packCells is user-configured.
    uint32_t vPkMin  = (uint32_t)packCells * 3000UL;
    uint32_t vPkMax  = (uint32_t)packCells * 4200UL;
    uint32_t vAct    = batt.voltage_mv;
    uint32_t vEscMv;
    if (escKill) {
        vEscMv = 0;
    } else if (vAct <= vPkMin) {
        vEscMv = 30000UL;
    } else if (vAct >= vPkMax) {
        vEscMv = 42000UL;
    } else {
        vEscMv = 30000UL + (vAct - vPkMin) * 12000UL / (vPkMax - vPkMin);
    }
    uint16_t v10mv = (uint16_t)(vEscMv / 10);
    payload[1] = v10mv & 0xFF;
    payload[2] = (v10mv >> 8) & 0xFF;

    // M365 convention: negative current = charging, positive = discharging
    // JBD convention may differ — flip sign if needed
    int16_t cur = batt.current_ma;
    payload[3] = (uint8_t)(cur & 0xFF);
    payload[4] = (uint8_t)((cur >> 8) & 0xFF);

    int16_t temp = (batt.ntc_count > 0) ? batt.temp_c10[0] : 250;  // default 25 °C
    payload[5] = (uint8_t)(temp & 0xFF);
    payload[6] = (uint8_t)((temp >> 8) & 0xFF);

    payload[7] = batt.remaining_mah & 0xFF;
    payload[8] = (batt.remaining_mah >> 8) & 0xFF;

    payload[9] = batt.cell_count;

    return buildM365Packet(out, ADDR_BMS, ADDR_ESC, 0x01, payload, sizeof(payload));
}

/**
 * Build a BMS cell-voltage packet (BMS->ESC, cmd 0x02 — verify cmd byte).
 * Payload: [cell_count] then cell_count * uint16_LE voltages in mV.
 */
uint8_t buildBmsCellPacket(uint8_t* out) {
    uint8_t payload[1 + 20 * 2];
    uint8_t n = batt.cell_count;
    if (n > 20) n = 20;

    payload[0] = n;
    for (uint8_t i = 0; i < n; i++) {
        payload[1 + i * 2]     = batt.cell_mv[i] & 0xFF;
        payload[1 + i * 2 + 1] = (batt.cell_mv[i] >> 8) & 0xFF;
    }

    return buildM365Packet(out, ADDR_BMS, ADDR_ESC, 0x02, payload, 1 + n * 2);
}

// ─── M365 ESC request handler ─────────────────────────────────────────────────

/**
 * Consume bytes from m365Serial and respond to ESC requests.
 * ESC sends read-request packets addressed to BMS (dst == ADDR_BMS).
 */
void processM365Input() {
    while (m365Serial.available()) {
        uint8_t b = (uint8_t)m365Serial.read();

        // Sync to header
        if (m365RxLen == 0 && b != 0x55) continue;
        if (m365RxLen == 1 && b != 0xAA) { m365RxLen = 0; continue; }

        if (m365RxLen < sizeof(m365RxBuf)) {
            m365RxBuf[m365RxLen++] = b;
        } else {
            m365RxLen = 0;  // overflow, reset
            continue;
        }

