The-Nicolini/M365-JBD-BATTERY-BRIDGE-ESP32/src/main.cpp
        // Need at least 3 bytes (55 AA pkt_len) before we know total length
        if (m365RxLen < 3) continue;

        uint8_t pkt_len      = m365RxBuf[2];
        uint8_t totalExpected = 2 + 1 + pkt_len + 2;  // 55 AA + pkt_len + payload + 2 crc

        if (m365RxLen < totalExpected) continue;

        // Full packet in buffer — verify CRC
        uint16_t crc_calc = m365Crc(&m365RxBuf[2], 1 + pkt_len);
        uint16_t crc_recv = (uint16_t)m365RxBuf[totalExpected - 2] |
                            ((uint16_t)m365RxBuf[totalExpected - 1] << 8);

        if (crc_calc != crc_recv) {
            Serial.printf("[M365] CRC mismatch: calc=%04X recv=%04X\n", crc_calc, crc_recv);
            m365RxLen = 0;
            continue;
        }

        uint8_t src = m365RxBuf[3];
        uint8_t dst = m365RxBuf[4];
        uint8_t cmd = m365RxBuf[5];
        uint8_t dataLen = (pkt_len >= 3) ? pkt_len - 3 : 0;

        // ── Raw packet log — helps identify light control cmd byte ──
        // Remove or guard with #ifdef once cmd is found.
        Serial.printf("[M365] src=%02X dst=%02X cmd=%02X data(%u):", src, dst, cmd, dataLen);
        for (uint8_t i = 0; i < dataLen && i < 16; i++)
            Serial.printf(" %02X", m365RxBuf[6 + i]);
        Serial.println();

        // ESC polling BMS
        if (dst == ADDR_BMS) {
            uint8_t resp[64];
            uint8_t respLen = 0;

            switch (cmd) {
                case 0x01:  // Basic status request
                    if (batt.valid) respLen = buildBmsStatusPacket(resp);
                    break;
                case 0x02:  // Cell voltage request
                    if (batt.valid) respLen = buildBmsCellPacket(resp);
                    break;
                // ── Taillight / brake light control ──
                // TODO: replace 0xFF with real cmd byte once identified from log.
                // Data byte [0]: 0x01 = on, 0x00 = off  (verify from capture)
                case 0xFF:
                    if (dataLen >= 1) {
                        bool lightOn = (m365RxBuf[6] & 0x01) != 0;
                        Serial.printf("[Light] ESC cmd taillight %s\n", lightOn ? "ON" : "OFF");
                        // Override brightness logic: ESC says on → full duty; off → running level
                        // Taillight is controller-switched; do not drive MOSFET.
                    }
                    respLen = buildM365Packet(resp, ADDR_BMS, ADDR_ESC, cmd, nullptr, 0);
                    break;
                default:
                    // Unknown command — ACK so ESC doesn't hang
                    respLen = buildM365Packet(resp, ADDR_BMS, ADDR_ESC, cmd, nullptr, 0);
                    break;
            }

            if (respLen > 0) m365Serial.write(resp, respLen);
        }

        m365RxLen = 0;
    }
}

// ─── JBD timer state ───────────────────────────────────────────────────────
static uint32_t lastJbdPoll  = 0;
static uint32_t lastM365Push = 0;

// ─── protocol initialization and JBD polling ─────────────────────────────────
void protocolInit() {
#if defined(ESP32) || defined(ESP32S3) || defined(ESP32C3)
    jbdSerial.begin(9600, SERIAL_8N1, JBD_RX, JBD_TX);
    m365Serial.begin(115200, SERIAL_8N1, M365_RX, M365_TX);
#elif defined(ESP8266)
    jbdSerial.begin(9600);
    m365Serial.begin(115200);
#endif
    batt = {};
    batt.valid = false;
}

void pollJbd() {
    if (millis() - lastJbdPoll < jbdPollMs) return;
    lastJbdPoll = millis();

    batt.valid = false;
    while (jbdSerial.available()) jbdSerial.read();
    jbdSerial.write(JBD_CMD_BASIC, sizeof(JBD_CMD_BASIC));
    if (readJbdResponse() && parseJbdBasicInfo(jbdRxBuf, jbdRxLen)) {
        while (jbdSerial.available()) jbdSerial.read();
        delay(20);
        jbdSerial.write(JBD_CMD_CELLS, sizeof(JBD_CMD_CELLS));
        if (readJbdResponse()) {
            parseJbdCellInfo(jbdRxBuf, jbdRxLen);
        }
    } else {
        Serial.println("[JBD] basic info read failed");
    }
}

// ─── WiFi AP + HTTP server init ───────────────────────────────────────────────
static void wifiInit() {
    WiFi.softAP(apSsid, apPass);
    IPAddress ip = WiFi.softAPIP();
    Serial.printf("[WiFi] AP '%s' ready — open http://%s\n", apSsid, ip.toString().c_str());

    webServer.on("/",         HTTP_GET,  handleRoot);
    webServer.on("/data",     HTTP_GET,  handleData);
    webServer.on("/bt",       HTTP_POST, handleBtToggle);
    webServer.on("/kill",     HTTP_POST, handleKillToggle);
    webServer.on("/settings", HTTP_POST, handleSettings);
    webServer.begin();
    Serial.println("[WiFi] HTTP server started on port 80");
    apStartMs = millis();  // start idle countdown
}

// ─── Setup ───────────────────────────────────────────────────────────────────
void setup() {
    Serial.begin(115200);
    Serial.println("[bridge] JBD<->M365 bridge starting");
    hardwareInit();
#if defined(ESP32) || defined(ESP32S3) || defined(ESP32C3)
    {
        String ssid = prefs.getString("ssid", "");
        if (ssid.length()) strlcpy(apSsid, ssid.c_str(), sizeof(apSsid));
        String pass = prefs.getString("pass", "");
        if (pass.length()) strlcpy(apPass, pass.c_str(), sizeof(apPass));
        otaEnabled = prefs.getBool("ota", false);
    }
#endif
    protocolInit();
    webserverInit();
}

// ─── Loop ────────────────────────────────────────────────────────────────────
void loop() {
    pollJbd();
    processM365Input();
    webserverLoop();
}
